In [5]:
import pandas as pd

In [2]:
stud_name=["hema","priya","vaishu","anu","suba"]
stud_id=[101,102,103,104,105]
marks=[480,492,320,420,499]

In [3]:
data=pd.DataFrame({"stud":stud_name,"Stud":stud_id,"Marks":marks})

In [4]:
data

     stud  Stud  Marks
0    hema   101    480
1   priya   102    492
2  vaishu   103    320
3     anu   104    420
4    suba   105    499

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stud    5 non-null      object
 1   Stud    5 non-null      int64
 2   Marks   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [8]:
data.stud

0      hema
1     priya
2    vaishu
3       anu
4      suba
Name: stud, dtype: object

In [9]:
data["Marks"]

0    480
1    492
2    320
3    420
4    499
Name: Marks, dtype: int64

In [11]:
data.to_csv("stud_marks.csv",index=False)

In [6]:
malan_jewels=["chain","ring","bracelet","earings","coins"]
price=[42000,22000,45000,18000,9999]
offer=[20,50,25,10,5]

In [10]:
data=pd.DataFrame({"malan":malan_jewels,"Malan":price,"Offer":offer})

In [11]:
data

      malan  Malan  Offer
0     chain  42000     20
1      ring  22000     50
2  bracelet  45000     25
3   earings  18000     10
4     coins   9999      5

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   malan   5 non-null      object
 1   Malan   5 non-null      int64
 2   Offer   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [13]:
data.malan

0       chain
1        ring
2    bracelet
3     earings
4       coins
Name: malan, dtype: object

In [16]:
data["Offer"]

0    20
1    50
2    25
3    10
4     5
Name: Offer, dtype: int64

In [17]:
data.to_csv("Malan_jewels.csv",index=False)